We want to create a new cluster.
Please find the plan output, below:

```

Terraform will perform the following actions:

  # module.ske.stackit_ske_cluster.ske will be created
  + resource "stackit_ske_cluster" "ske" {
      + extensions              = {
          + acl   = {
              + allowed_cidrs = [
                  + "0.0.0.0/0",
                ]
              + enabled       = true
            }
          + argus = {
              + argus_instance_id = "79668603-adc7-4fb3-ab8e-1ceec7b89a17"
              + enabled           = true
            }
        }
      + hibernations            = []
      + id                      = (known after apply)
      + kube_config             = (sensitive value)
      + kubernetes_version      = "1.26"
      + kubernetes_version_used = (known after apply)
      + maintenance             = {
          + enable_kubernetes_version_updates    = true
          + enable_machine_image_version_updates = true
          + end                                  = "02:23:45Z"
          + start                                = "01:23:45Z"
        }
      + name                    = "tobi-sbx"
      + node_pools              = [
          + {
              + availability_zones = [
                  + "eu01-3",
                ]
              + cri                = "containerd"
              + labels             = {
                  + "pool"  = "pool-1"
                  + "stage" = "sbx"
                }
              + machine_type       = "c1.3"
              + max_surge          = 1
              + max_unavailable    = 1
              + maximum            = 4
              + minimum            = 2
              + name               = "groot-sbx01"
              + os_name            = "flatcar"
              + os_version         = "3602.2.1"
              + volume_size        = 20
              + volume_type        = "storage_premium_perf1"
            },
        ]
      + project_id              = "7199c212-5324-4877-a0f3-c935e91f30c2"
    }

  # module.vault.vault_kv_secret_v2.vault will be created
  + resource "vault_kv_secret_v2" "vault" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = false
      + disable_read        = false
      + id                  = (known after apply)
      + metadata            = (known after apply)
      + mount               = "a84d701e-1f82-46e9-b905-f145d8124c38"
      + name                = "terraform"
      + path                = (known after apply)

      + custom_metadata {
          + max_versions = 3
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + kube_config             = (sensitive value)
  + kubernetes_version_used = (known after apply)
```